Repository: jojhaa/Codex-Dream-Skin-Windows
Catalog: windows/app/CodexDreamSkin/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# ThemePreviewDarkModeToggle.Header
source: Preview mode
zh_cn: 预览模式

# ThemeLivePreviewToggle.Header
source: Live sync to Codex
zh_cn: 实时同步到 Codex

# ThemeLivePreviewToggle.OffContent
source: Off
zh_cn: 关闭

# ThemeLivePreviewToggle.OnContent
source: On
zh_cn: 开启

# ThemeLivePreviewToggle.AutomationProperties.Name
source: Automatically hot reload theme edits into Codex
zh_cn: 编辑时自动热重载主题到 Codex

# ThemeLivePreviewStatus.Text
source: When enabled, draft changes preview automatically after a short debounce and are never auto-saved.
zh_cn: 开启后，草稿变化会在短暂防抖后自动预览，不会自动保存。

# ThemePreviewDarkModeToggle.OffContent
source: Light
zh_cn: 浅色

# ThemePreviewDarkModeToggle.OnContent
source: Dark
zh_cn: 深色

# ThemeMessagePreviewLabel.Text
source: Message text contrast preview
zh_cn: 消息区文字对比度预览

# ThemeAutoPalette.Header
source: Automatic palette
zh_cn: 自动配色

# ThemePaletteAnalysisHint.Text
source: Choose a preset to analyze the current regional image while excluding skin tones from accent and glass suggestions.
zh_cn: 选择方案后将分析当前区域图片，并避开肤色生成强调色和玻璃参数。

# ThemeFreshPaletteButton.Content
source: Fresh blue-white
zh_cn: 清新蓝白

# ThemeFreshPaletteButton.AutomationProperties.Name
source: Generate a fresh blue-white palette from the image
zh_cn: 从图片生成清新蓝白配色

# ThemeMidnightPaletteButton.Content
source: Midnight blue
zh_cn: 深蓝夜景

# ThemeMidnightPaletteButton.AutomationProperties.Name
source: Generate a midnight blue palette from the image
zh_cn: 从图片生成深蓝夜景配色

# ThemeLowFogPaletteButton.Content
source: Low-fog glass
zh_cn: 低雾透明

# ThemeLowFogPaletteButton.AutomationProperties.Name
source: Generate a low-fog glass palette from the image
zh_cn: 从图片生成低雾透明配色

# ThemeComponentMaterialsEditor.Header
source: Advanced component materials
zh_cn: 组件级高级材质

# ThemeComponentMaterialSlot.Header
source: Edit component
zh_cn: 编辑组件

# ThemeComponentMessages.Content
source: Assistant messages
zh_cn: 助手消息

# ThemeComponentSummaries.Content
source: File and output summaries
zh_cn: 文件与输出摘要

# ThemeComponentPreviews.Content
source: Task hover previews
zh_cn: 任务悬浮预览

# ThemeComponentMenus.Content
source: Menus and popups
zh_cn: 菜单与弹窗

# ThemeComponentWorkspace.Content
source: Terminal and right workspace
zh_cn: 终端与右侧工作区

# ThemeComponentCode.Content
source: Code diffs
zh_cn: 代码差异

# ThemeComponentSuggestions.Content
source: Home suggestions
zh_cn: 首页建议卡

# ThemeComponentColorLabel.Text
source: Tint (#RRGGBB)
zh_cn: 主题色（#RRGGBB）

# ThemeComponentOpacityLabel.Text
source: Opacity
zh_cn: 透明度

# ThemeLightComponentColorTextBox.AutomationProperties.Name
source: Light component tint
zh_cn: 浅色组件主题色

# ThemeDarkComponentColorTextBox.AutomationProperties.Name
source: Dark component tint
zh_cn: 深色组件主题色

# ThemeLightComponentOpacitySlider.AutomationProperties.Name
source: Light component opacity
zh_cn: 浅色组件透明度

# ThemeDarkComponentOpacitySlider.AutomationProperties.Name
source: Dark component opacity
zh_cn: 深色组件透明度

# ThemeResetComponentMaterialButton.Content
source: Restore recommended material
zh_cn: 恢复当前组件推荐材质

# ThemeResetComponentMaterialButton.AutomationProperties.Name
source: Restore the selected component color and opacity
zh_cn: 恢复当前组件的推荐颜色和透明度

# ThemeActualRegionStatus.Text
source: Reading live Codex regions…
zh_cn: 正在读取 Codex 实际区域…

# ThemeRefreshActualRegionButton.Content
source: Refresh live size
zh_cn: 刷新实际尺寸

# ThemeRefreshActualRegionButton.AutomationProperties.Name
source: Refresh actual region sizes from the current Codex window
zh_cn: 从当前 Codex 窗口刷新区域实际尺寸

# DiagnosticsPortsTitle.Text
source: Theme ports and owning processes
zh_cn: 主题端口与占用进程

# DiagnosticsPortsBody.Text
source: Inspect managed loopback ports and close only verified official Codex processes.
zh_cn: 检测受管回环端口，并仅允许关闭已验证的官方 Codex 进程。

# RefreshPorts.Content
source: Inspect ports
zh_cn: 检测端口

# RefreshPorts.AutomationProperties.Name
source: Inspect theme ports and owning processes again
zh_cn: 重新检测主题端口和占用进程

# ClosePortProcess.Content
source: Close process
zh_cn: 关闭进程

# ClosePortProcess.AutomationProperties.Name
source: Close the verified Codex process that owns this port
zh_cn: 关闭占用该端口的已验证 Codex 进程

# PortPackageMissing
source: The current Codex Store package was not found, so port owners cannot be verified.
zh_cn: 未发现当前 Codex Store 包，无法验证端口进程。

# PortSummaryFormat
source: Inspected loopback ports {0}–{1}; found {2} listener entries.
zh_cn: 已检测回环端口 {0}–{1}，发现 {2} 个监听项。

# PortStatusFree
source: Available
zh_cn: 可用

# PortStatusCurrentCodex
source: Current Codex
zh_cn: 当前 Codex

# PortStatusPreviousCodex
source: Previous Codex
zh_cn: 旧版 Codex

# PortStatusOtherProcess
source: Other process
zh_cn: 其他进程

# PortStatusNonLoopback
source: Non-loopback listener
zh_cn: 非回环监听

# PortStatusUnreadable
source: Identity unavailable
zh_cn: 身份不可读

# PortDetailAvailable
source: No process is currently using this port
zh_cn: 当前没有进程占用

# PortDetailUnknown
source: Process identity unavailable
zh_cn: 进程身份不可用

# ClosePortDialogTitle
source: Close the port-owning process?
zh_cn: 关闭端口占用进程？

# ClosePortDialogBodyFormat
source: PID {0} will be closed gracefully first and its process tree ended if required to release port {1}. This runs only after the process is verified again as official Codex; protected processes show a Windows administrator confirmation.
zh_cn: 将先尝试正常关闭 PID {0}，必要时结束其进程树，并释放端口 {1}。仅当再次验证为官方 Codex 进程时才会执行；受保护进程会显示 Windows 管理员确认。

# ClosePortDialogConfirm
source: Close process
zh_cn: 关闭进程

# ClosePortDialogCancel
source: Cancel
zh_cn: 取消

# ClosePortSuccess
source: Port process closed
zh_cn: 端口进程已关闭

# ClosePortPending
source: Process handled; the port is still being released
zh_cn: 进程已处理，端口仍在释放

# ClosePortFailed
source: Could not close port process
zh_cn: 无法关闭端口进程

# ClosePortResultFormat
source: Port {0}, PID {1}.
zh_cn: 端口 {0}，PID {1}。

# TrayTooltip
source: Codex Dream Skin
zh_cn: Codex 梦幻皮肤

# TrayOpenManager
source: &Open manager
zh_cn: 打开管理器(&O)

# TrayOpenThemes
source: &Themes
zh_cn: 主题(&T)

# TrayOpenDiagnostics
source: &Diagnostics
zh_cn: 诊断(&D)

# TrayOpenSettings
source: &Settings
zh_cn: 设置(&S)

# TrayHide
source: &Hide window
zh_cn: 隐藏窗口(&H)

# TrayExit
source: E&xit
zh_cn: 退出(&X)

# ThemeStudioToolsTitle.Text
source: Editing tools
zh_cn: 编辑工具

# ThemeRailLibraryButton.Content
source: Theme library
zh_cn: 主题库

# ThemeRailToolsButton.Content
source: Editing tools
zh_cn: 编辑工具

# ThemeStudioDraftLabel.Text
source: Draft
zh_cn: 草稿

# ThemeToolGroupBasic.Text
source: Basic
zh_cn: 基础

# ThemeToolGroupVisual.Text
source: Visual
zh_cn: 画面

# ThemeToolGroupInterface.Text
source: Interface
zh_cn: 界面

# ThemeToolGroupManagement.Text
source: Management
zh_cn: 管理

# ThemeToolOverview.Content
source: Theme overview
zh_cn: 主题概览

# ThemeToolColorMaterials.Content
source: Color and materials
zh_cn: 色彩与材质

# ThemeToolTypography.Content
source: Typography
zh_cn: 字体排版

# ThemeToolBackgroundComposition.Content
source: Background and crop
zh_cn: 背景与构图

# ThemeToolInterfaceAssets.Content
source: Interface assets
zh_cn: 界面素材

# ThemeToolDecoration.Content
source: Decoration
zh_cn: 装饰效果

# ThemeToolComponentStyles.Content
source: Component styles
zh_cn: 组件样式

# ThemeToolLayoutSpacing.Content
source: Layout and spacing
zh_cn: 布局与间距

# ThemeToolLocalization.Content
source: Interface translation
zh_cn: 界面翻译

# ThemeToolFloatingWindows.Content
source: Floating windows
zh_cn: 悬浮窗口

# ThemeToolThemeInfo.Content
source: Theme information
zh_cn: 主题信息

# ThemeToolHistory.Content
source: Version history
zh_cn: 版本记录

# ThemeStudioPreviewTitle.Text
source: Isolated Codex UI preview
zh_cn: Codex UI 隔离预览

# ThemeStudioPreviewSubtitle.Text
source: Complete Codex Desktop simulation with window chrome, sidebar, home, tasks, composer, and Settings.
zh_cn: 完整模拟 Codex Desktop 的窗口、侧栏、主页、任务、输入区和设置页。

# ThemeStudioResetPreviewButton.Content
source: Reset interaction
zh_cn: 重置互动

# ThemeStudioResetPreviewButton.AutomationProperties.Name
source: Reset isolated-preview interaction state
zh_cn: 重置隔离预览互动状态

# ThemeStudioPreviewPhaseHint.Text
source: The isolated preview never reads real chats, accounts, projects, or Codex settings.
zh_cn: 隔离预览不会读取真实聊天、账号、项目或 Codex 设置。

# PreviewChromeMenus.Text
source: File Edit View Help
zh_cn: 文件 编辑 视图 帮助

# PreviewSceneHomeButton.Content
source: Home
zh_cn: 首页

# PreviewSceneTaskButton.Content
source: Task
zh_cn: 任务

# PreviewSceneSettingsButton.Content
source: Settings
zh_cn: 设置

# PreviewNewTaskButton.Content
source: ＋ New task
zh_cn: ＋ 新建任务

# PreviewPullRequestButton.Content
source: Pull requests
zh_cn: 拉取请求

# PreviewSitesButton.Content
source: Sites
zh_cn: 站点

# PreviewProjectsLabel.Text
source: Projects
zh_cn: 项目

# PreviewProjectOne.Text
source: Theme studio
zh_cn: 主题工作室

# PreviewProjectTwo.Text
source: Diagnostics and connection
zh_cn: 诊断与连接

# PreviewProjectThree.Text
source: Automation scripts
zh_cn: 自动化脚本

# PreviewSidebarSettingsButton.Content
source: Settings
zh_cn: 设置

# PreviewHomePrompt.Text
source: What should we work on?
zh_cn: 我们今天处理什么？

# PreviewSuggestionExplore.Content
source: Explore and understand code
zh_cn: 探索并理解代码

# PreviewSuggestionBuild.Content
source: Build a new feature
zh_cn: 构建新功能

# PreviewSuggestionReview.Content
source: Review code and suggest improvements
zh_cn: 审查代码并提出建议

# PreviewSuggestionFix.Content
source: Fix problems and failures
zh_cn: 修复问题和失败

# PreviewComposerTextBox.PlaceholderText
source: Describe a task or type a message
zh_cn: 描述任务或输入消息

# PreviewSendButton.AutomationProperties.Name
source: Send isolated-preview message
zh_cn: 发送隔离预览消息

# PreviewTaskTitle.Text
source: Theme studio refactor
zh_cn: 主题工作室重构

# PreviewAssistantMessage.Text
source: This is an isolated task scene. Code, commands, network, and real Codex sessions are never accessed.
zh_cn: 这是隔离任务场景。代码、命令、网络和真实 Codex 会话都不会被访问。

# PreviewSimulatedReply.Text
source: Simulated reply: received only by the local preview session; no real action was executed.
zh_cn: 模拟回复：已在本地预览会话中接收，不会执行实际操作。

# PreviewTaskHint.Text
source: Local simulated task · no network side effects
zh_cn: 本地模拟任务 · 无网络副作用

# PreviewSettingsTitle.Text
source: Settings
zh_cn: 设置

# PreviewSettingsGeneral.Content
source: General
zh_cn: 常规

# PreviewSettingsGeneralHeading.Text
source: General
zh_cn: 常规

# PreviewSettingsAppearance.Content
source: Appearance
zh_cn: 外观

# PreviewSettingsNotifications.Content
source: Notifications
zh_cn: 通知

# PreviewSettingsNotificationsLabel.Text
source: Desktop notifications
zh_cn: 桌面通知

# PreviewSettingsExtensions.Content
source: Extensions
zh_cn: 扩展

# PreviewSettingsLanguage.Text
source: Interface language
zh_cn: 界面语言

# PreviewSettingsTheme.Text
source: Dark appearance
zh_cn: 深色外观

# PreviewSettingsIsolationInfo.Title
source: Isolated settings
zh_cn: 隔离设置

# PreviewSettingsIsolationInfo.Message
source: These switches and selections exist only in the preview session.
zh_cn: 这里的开关和选择只存在于预览会话中。

# PreviewFooterIsolation.Text
source: Complete Codex page fixture · locally isolated · no network access
zh_cn: 完整 Codex 页面 fixture · 本地隔离 · 无网络访问

# ThemeStudioPlannedToolInfo.Title
source: Available in the theme-format expansion phase
zh_cn: 将在主题格式升级阶段提供

# ThemeStudioPlannedToolInfo.Message
source: The three-pane studio first migrates existing behavior. This tool requires bounded schema, validation, history, package, and renderer support.
zh_cn: 三栏工作室先迁移现有能力；此工具需要受限 schema、验证、历史、导入导出和 renderer 同步支持。

# ThemeStudioPlannedToolBoundary.Text
source: This build does not expose settings that cannot work and never accepts arbitrary CSS, scripts, or DOM selectors.
zh_cn: 当前版本不会创建无效设置，也不允许任意 CSS、脚本或 DOM 选择器。

# ThemeStudioHistoryDescription.Text
source: View saved theme snapshots and restore one when there are no unsaved changes or temporary previews.
zh_cn: 查看已保存的主题快照，并在没有未保存修改或临时预览时恢复历史版本。

# ThemeStudioOpenHistoryButton.Content
source: Open version history
zh_cn: 打开版本记录

# PreviewScheduledButton.Content
source: Scheduled
zh_cn: 已安排

# PreviewPluginsButton.Content
source: Plugins
zh_cn: 插件

# PreviewPinnedLabel.Text
source: Pinned
zh_cn: 置顶

# PreviewRecentLabel.Text
source: Recent
zh_cn: 最近

# PreviewLocalUser.Text
source: Sample user
zh_cn: 示例用户

# PreviewHomeEdition.Text
source: CODEX DESKTOP · THEME PREVIEW
zh_cn: CODEX DESKTOP · 主题预览

# PreviewHomeSubtitle.Text
source: Choose a project or describe the task you want to complete.
zh_cn: 选择一个项目，或直接描述你想完成的任务。

# PreviewComposerMode.Text
source: 5.6 Sol · locally isolated
zh_cn: 5.6 Sol · 本地隔离

# PreviewOpenLocationButton.Content
source: Open location
zh_cn: 打开位置

# PreviewTaskElapsed.Text
source: Worked for 4m 27s
zh_cn: 已处理 4m 27s

# PreviewTaskCommandStatus.Text
source: Ran several commands
zh_cn: 运行了多个命令

# PreviewTaskDetailMessage.Text
source: Reviewing page structure, resources, and interaction boundaries. Everything here is visual-only and no real commands are executed.
zh_cn: 当前正在检查页面结构、资源和交互边界。所有内容只用于视觉预览，不会执行真实命令。

# PreviewEnvironmentTitle.Text
source: Environment
zh_cn: 环境信息

# PreviewEnvironmentChanges.Text
source: Changes
zh_cn: 变更

# PreviewEnvironmentLocal.Text
source: Local
zh_cn: 本地

# PreviewEnvironmentProcesses.Text
source: Background processes
zh_cn: 后台进程

# PreviewBackToAppButton.Content
source: ← Back to app
zh_cn: ← 返回应用

# PreviewSettingsSearchBox.PlaceholderText
source: Search settings…
zh_cn: 搜索设置…

# PreviewSettingsPersonalLabel.Text
source: Personal
zh_cn: 个人

# PreviewSettingsProfile.Content
source: Profile
zh_cn: 个人资料

# PreviewSettingsLanguageNav.Content
source: Language
zh_cn: 语言

# PreviewSettingsConfiguration.Content
source: Configuration
zh_cn: 配置

# PreviewSettingsPersonalization.Content
source: Personalization
zh_cn: 个性化

# PreviewSettingsShortcuts.Content
source: Keyboard shortcuts
zh_cn: 键盘快捷键

# PreviewSettingsUsage.Content
source: Usage and billing
zh_cn: 使用情况和计费

# PreviewSettingsAccount.Content
source: Account
zh_cn: 账户

# PreviewSettingsIntegrationLabel.Text
source: Integrations
zh_cn: 集成

# PreviewSettingsBrowser.Content
source: Browser
zh_cn: 浏览器

# PreviewSettingsComputer.Content
source: Computer use
zh_cn: 电脑操控

# PreviewSettingsAppearanceTitle.Text
source: Appearance
zh_cn: 外观

# PreviewSettingsThemeSection.Text
source: Theme
zh_cn: 主题

# PreviewThemeSystem.Text
source: System
zh_cn: 系统

# PreviewThemeLight.Text
source: Light
zh_cn: 浅色

# PreviewThemeDark.Text
source: Dark
zh_cn: 深色

# PreviewBrandSignature.Text
source: Kanna / Moment
zh_cn: Kanna / 璟奈

# PreviewHomePromptPrefix.Text
source: What should we do in
zh_cn: 我们应该在

# PreviewSelectedProjectPill.Text
source: Choose project · windows
zh_cn: 选择项目 · windows

# PreviewHomePromptSuffix.Text
source: today?
zh_cn: 中做些什么？

# PreviewProjectSelectorLabel.Text
source: 01 / CHOOSE PROJECT
zh_cn: 01 / 选择项目

# PreviewComposerCustom.Text
source: Custom
zh_cn: 自定义
